tutorials/FF/channel-channel/pimpleFoam-pimpleFoam/Fluid1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

x0 0; 
x1 1;
y0 0;
y1 0.5;
z0 0;
z1 0.1;

nx 50;
ny 20;
nz 10;

vertices
(
    ($x0 $y0 $z0)   // 0
    ($x1 $y0 $z0)   // 1
    ($x1 $y1 $z0)   // 2
    ($x0 $y1 $z0)   // 3
    ($x0 $y0 $z1)   // 4
    ($x1 $y0 $z1)   // 5
    ($x1 $y1 $z1)   // 6
    ($x0 $y1 $z1)   // 7
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 )
    ( $nx $ny $nz )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 4 7 3 )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 1 2 6 5 )
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            ( 0 1 5 4 )
            ( 0 3 2 1 )
            ( 3 7 6 2 )
            ( 4 5 6 7 )
        );
    }
);

// ************************************************************************* //
